app/Controllers/Home.php

public function dashboard()
{
    if (!session()->get('logged_in')) {
        return redirect()->to('/login');
    }

    $keluhanModel = new KeluhanModel();

    $totalKeluhan = $keluhanModel->countAll();
    $sudahDitanggapi = $keluhanModel->where('status', 'selesai')->countAllResults();
    $belumDitanggapi = $keluhanModel->where('status', 'menunggu')->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `keluhan`
SELECT COUNT(*) AS `numrows`
FROM `keluhan`
WHERE `status` = 'selesai'
SELECT COUNT(*) AS `numrows`
FROM `keluhan`
WHERE `status` = 'menunggu'

    public function dataKeluhan()
    {
        $keluhan = new KeluhanModel();

        if (session()->get('logged_in') != true) {
            return redirect()->to('/login');
        }

        $data = [
            'title' => 'Data Keluhan',
            'keluhan' => $keluhan->findAll()
        ];
---
SELECT *
FROM `keluhan`

    public function deleteKeluhan($id_keluhan)
    {
    $keluhan = new KeluhanModel();
    $cek = $keluhan->find($id_keluhan);

    if (!$cek) {
        return redirect()->back()->with('error', 'Data tidak ditemukan🤧');
    }

    $keluhan->delete($id_keluhan);
---
SELECT *
FROM `keluhan`
WHERE `keluhan`.`id_keluhan` = '16'
DELETE FROM `keluhan`
WHERE `id_keluhan` IN ('36')

    public function tanggapanKeluhan($id_keluhan)
    {
        $keluhan = new KeluhanModel();
        $data = [
            'title' => 'Give Feedback',
            'keluhan' => $keluhan->find($id_keluhan)
---
SELECT *
FROM `keluhan`
WHERE `keluhan`.`id_keluhan` = '42'